In [9]:
from __future__ import division
import pandas as pd

df = pd.read_excel('titanic3.xls')
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO"
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON"
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON"
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON"

In [70]:
import numpy as np
df['family'] = np.where((df['sibsp']>0)|(df['parch']>0),1,0)
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,family,child,familysize
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",0,0,1
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",1,1,4
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",1,1,4
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON",1,0,4
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",1,0,4

In [69]:
df_dead = df[df['survived']==0]
df_family = df[df['family']==1]

In [12]:
p_dead = len(df_dead)/len(df)
p_dead

0.6180290297937356

In [13]:
p_family = len(df_family)/len(df)
p_family

0.3964858670741024

In [68]:
df_dead_family = df_dead[df_dead['family']==1]
p_deadfamily = len(df_dead_family)/len(df_dead)
p_deadfamily

0.3189122373300371

In [15]:
# Probability that someone died given they had family onboard
p_dead_given_family = (p_dead * p_deadfamily)/p_family
p_dead_given_family

0.49710982658959535

In [65]:
df['familysize'] = df['sibsp']+df['parch']+1
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,family,child,familysize
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",0,0,1
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",1,1,4
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",1,1,4
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON",1,0,4
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",1,0,4

In [66]:
df['familysize'].max()

11

In [67]:
df.groupby(['familysize','survived'])['name'].count()

familysize  survived
1           0           551
            1           239
2           0           109
            1           126
3           0            69
            1            90
4           0            13
            1            30
5           0            16
            1             6
6           0            20
            1             5
7           0            12
            1             4
8           0             8
11          0            11
Name: name, dtype: int64

In [78]:
df_largefamily = df[df['familysize']>=5]
df_smallfamily = df[df['familysize']<5]

In [79]:
p_largefamily = len(df_largefamily)/len(df)
p_largefamily

0.06264323911382735

In [80]:
p_smallfamily = len(df_smallfamily)/len(df)
p_smallfamily

0.9373567608861727

In [81]:
df_deadlfam = df_dead[df_dead['familysize']>=5]
p_deadlfam = len(df_deadlfam)/len(df_dead)
p_deadlfam

0.08281829419035847

In [82]:
#Probability of dying given they had a large family
p_dead_given_lfam = (p_dead*p_deadlfam)/p_largefamily
p_dead_given_lfam

0.8170731707317072

In [16]:
df['child'] = np.where(df['age']<16,1,0)
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,family,child
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",0,0
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",1,1
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",1,1
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON",1,0
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",1,0

In [17]:
df_child = df[df['age']<16]
p_child = len(df_child)/len(df)
p_child

0.08785332314744079

In [18]:
df_deadchild = df_dead[df_dead['age']<16]
p_deadchild = len(df_deadchild)/len(df_dead)
p_deadchild

0.06056860321384425

In [19]:
#Probability that someone died given they were a child
p_dead_given_child = (p_dead*p_deadchild)/p_child
p_dead_given_child

0.4260869565217391

In [20]:
df_old = df[df['age']>60]
p_old = len(df_old)/len(df)
p_old

0.025210084033613446

In [21]:
df_deadold = df_dead[df_dead['age']>60]
p_deadold = len(df_deadold)/len(df_dead)
p_deadold

0.030902348578491966

In [22]:
#Probability that someone died given they were old

p_dead_given_old = (p_dead*p_deadold)/p_old
p_dead_given_old

0.7575757575757576

In [23]:
df_young = df[(df['age']>=16)&(df['age']<=60)]
p_young = len(df_young)/len(df)
p_young

0.6860198624904508

In [24]:
df_deadyoung = df_dead[(df_dead['age']>=16)&(df_dead['age']<=60)]
p_deadyoung = len(df_deadyoung)/len(df_dead)
p_deadyoung

0.6736711990111248

In [25]:
#Probability that someone died given they were young
p_dead_given_young = (p_dead*p_deadyoung)/p_young
p_dead_given_young

0.6069042316258351

In [26]:
#Just checking -- probability of dying given they were old
df_olddead = df_old[df_old['survived']==0]
p_olddead = len(df_olddead)/len(df_old)
p_olddead

0.7575757575757576

In [60]:
df_rich = df[df['pclass']==1]
df_notrich = df[df['pclass']!=1]
df_poor = df[df['pclass']==3]
p_rich = len(df_rich)/len(df)
p_notrich = len(df_notrich)/len(df)
p_poor = len(df_poor)/len(df)
p_rich

0.24675324675324675

In [28]:
p_notrich

0.7532467532467533

In [61]:
p_poor

0.5416348357524828

In [31]:
df_deadrich = df_dead[df_dead['pclass']==1]
df_deadnrich = df_dead[df_dead['pclass']!=1]
p_deadrich = len(df_deadrich)/len(df_dead)
p_deadrich

0.15203955500618047

In [32]:
p_deadnrich = len(df_deadnrich)/len(df_dead)
p_deadnrich

0.8479604449938195

In [62]:
df_deadpoor = df_dead[df_dead['pclass']==3]

p_deadpoor = len(df_deadpoor)/len(df_dead)
p_deadpoor

0.6526576019777504

In [33]:
# Probability that someone died given they were not rich
p_dead_given_notrich = (p_dead*p_deadnrich)/p_notrich
p_dead_given_notrich

0.6957403651115618

In [63]:
# Probability that someone died given they were poor
p_dead_given_poor = (p_dead*p_deadpoor)/p_poor
p_dead_given_poor

0.7447108603667136

In [85]:
#Probability of dying given the person's poor & young
p_dead_gpy = (p_dead*p_deadpoor*p_deadyoung)/(p_poor*p_young)
p_dead_gpy

0.7313057327503164

In [86]:
#Probability of dying given the person's poor & old
p_dead_gpo = (p_dead*p_deadpoor*p_deadold)/(p_poor*p_old)
p_dead_gpo

0.9128614790238867

In [34]:
# Probability that someone died given they were rich
p_dead_given_rich = (p_dead*p_deadrich)/p_rich
p_dead_given_rich

0.3808049535603715

In [64]:
df.head()

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,family,child,familysize
0,1,1,"Allen, Miss. Elisabeth Walton",female,29.0000,0,0,24160,211.3375,B5,S,2,NaN,"St Louis, MO",0,0,0
1,1,1,"Allison, Master. Hudson Trevor",male,0.9167,1,2,113781,151.5500,C22 C26,S,11,NaN,"Montreal, PQ / Chesterville, ON",1,1,3
2,1,0,"Allison, Miss. Helen Loraine",female,2.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",1,1,3
3,1,0,"Allison, Mr. Hudson Joshua Creighton",male,30.0000,1,2,113781,151.5500,C22 C26,S,NaN,135.0,"Montreal, PQ / Chesterville, ON",1,0,3
4,1,0,"Allison, Mrs. Hudson J C (Bessie Waldo Daniels)",female,25.0000,1,2,113781,151.5500,C22 C26,S,NaN,NaN,"Montreal, PQ / Chesterville, ON",1,0,3

In [48]:

df_crew = df[(df['fare']==0)|(df['fare'].isnull())]
df_crew.count()

pclass       18
survived     18
name         18
sex          18
age           9
sibsp        18
parch        18
ticket       18
fare         17
cabin         4
embarked     18
boat          2
body          2
home.dest    11
family       18
child        18
dtype: int64

In [51]:
p_crew  = len(df_crew)/len(df)
p_crew

0.013750954927425516

In [52]:
df_deadcrew = df_dead[(df_dead['fare']==0)|(df_dead['fare'].isnull())]
p_deadcrew = len(df_deadcrew)/len(df_dead)
p_deadcrew

0.019777503090234856

In [53]:
#Probability that someone died given they were crew

p_dead_given_crew = (p_dead*p_deadcrew)/p_crew
p_dead_given_crew

0.8888888888888887

In [54]:
df_crew

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,family,child
7,1,0,"Andrews, Mr. Thomas Jr",male,39.0,0,0,112050,0.0,A36,S,NaN,NaN,"Belfast, NI",0,0
70,1,0,"Chisholm, Mr. Roderick Robert Crispin",male,NaN,0,0,112051,0.0,NaN,S,NaN,NaN,"Liverpool, England / Belfast",0,0
125,1,0,"Fry, Mr. Richard",male,NaN,0,0,112058,0.0,B102,S,NaN,NaN,NaN,0,0
150,1,0,"Harrison, Mr. William",male,40.0,0,0,112059,0.0,B94,S,NaN,110.0,NaN,0,0
170,1,1,"Ismay, Mr. Joseph Bruce",male,49.0,0,0,112058,0.0,B52 B54 B56,S,C,NaN,Liverpool,0,0
223,1,0,"Parr, Mr. William Henry Marsh",male,NaN,0,0,112052,0.0,NaN,S,NaN,NaN,Belfast,0,0
234,1,0,"Reuchlin, Jonkheer. John George",male,38.0,0,0,19972,0.0,NaN,S,NaN,NaN,"Rotterdam, Netherlands",0,0
363,2,0,"Campbell, Mr. William",male,NaN,0,0,239853,0.0,NaN,S,NaN,NaN,Belfast,0,0
384,2,0,"Cunningham, Mr. Alfred Fleming",male,NaN,0,0,239853,0.0,NaN,S,NaN,NaN,Belfast,0,0
410,2,0,"Frost, Mr. Anthony Wood ""Archie""",male,NaN,0,0,239854,0.0,NaN,S,NaN,NaN,Belfast,0,0
473,2,0,"Knight, Mr. Robert J",male,NaN,0,0,239855,0.0,NaN,S,NaN,NaN,Belfast,0,0
528,2,0,"Parkes, Mr. Francis ""Frank""",male,NaN,0,0,239853,0.0,NaN,S,NaN,NaN,Belfast,0,0
581,2,0,"Watson, Mr. Ennis Hastings",male,NaN,0,0,239856,0.0,NaN,S,NaN,NaN,Belfast,0,0
896,3,0,"Johnson, Mr. Alfred",male,49.0,0,0,LINE,0.0,NaN,S,NaN,NaN,NaN,0,0
898,3,0,"Johnson, Mr. William Cahoone Jr",male,19.0,0,0,LINE,0.0,NaN,S,NaN,NaN,NaN,0,0
963,3,0,"Leonard, Mr. Lionel",male,36.0,0,0,LINE,0.0,NaN,S,NaN,NaN,NaN,0,0
1225,3,0,"Storey, Mr. Thomas",male,60.5,0,0,3701,NaN,NaN,S,NaN,261.0,NaN,0,0
1254,3,1,"Tornquist, Mr. William Henry",male,25.0,0,0,LINE,0.0,NaN,S,15,NaN,NaN,0,0

In [84]:
df[df['ticket']=='LINE']

,pclass,survived,name,sex,age,sibsp,parch,ticket,fare,cabin,embarked,boat,body,home.dest,family,child,familysize
896,3,0,"Johnson, Mr. Alfred",male,49.0,0,0,LINE,0.0,NaN,S,NaN,NaN,NaN,0,0,1
898,3,0,"Johnson, Mr. William Cahoone Jr",male,19.0,0,0,LINE,0.0,NaN,S,NaN,NaN,NaN,0,0,1
963,3,0,"Leonard, Mr. Lionel",male,36.0,0,0,LINE,0.0,NaN,S,NaN,NaN,NaN,0,0,1
1254,3,1,"Tornquist, Mr. William Henry",male,25.0,0,0,LINE,0.0,NaN,S,15,NaN,NaN,0,0,1

In [87]:
#Most likely to die if they were poor & old
p_dead_gpo

0.9128614790238867